Каталог       = "D:\develop\1C\Projects\AnalysisUnmanagedForm\labs\";
ИмяФайла      = Каталог + "Form.bin";
ФайлРезультат = Каталог + "Form.xml";

ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, "UTF-8");
ЗаписьXML    = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ФайлРезультат, "UTF-8");

// Ищем начало блока внутреннего представления. Ищем по сигнатуре "{27,"

ПозицияНайдена = Ложь;
СигнатураНачалаБлока = "{27,";

Пока Истина Цикл
	
	ТекущийБлок = ЧтениеТекста.Прочитать(4);

	Если ТекущийБлок = СигнатураНачалаБлока Тогда

		ПозицияНайдена = Истина;
		Прервать;

	ИначеЕсли ТекущийБлок = Неопределено Тогда

		Прервать;

	КонецЕсли;

КонецЦикла;

Сообщить(?(ПозицияНайдена, "Начало блока найдено", "Не удалось найти начало блока"));

Если ПозицияНайдена Тогда

	ЗаписьXML.ЗаписатьНачалоЭлемента("node");
	ЗаписьXML.ЗаписатьНачалоЭлемента("value");
	ЗаписьXML.ЗаписатьТекст("27");
	ЗаписьXML.ЗаписатьКонецЭлемента();


	ТекущееЗначение = Неопределено;

	Пока Истина Цикл

		ТекущийСимвол = ЧтениеТекста.Прочитать(1);

		Если ТекущийСимвол = "{" Тогда

			ЗаписьXML.ЗаписатьНачалоЭлемента("node");

		ИначеЕсли СтрНайти("},", ТекущийСимвол) > 0 Тогда

			Если ТекущееЗначение <> Неопределено Тогда

				// Если Лев(ТекущееЗначение, 1) = Символы.ПС Тогда

				// 	ТекущееЗначение = Сред(ТекущееЗначение, 2);

				// КонецЕсли

				ЗаписьXML.ЗаписатьНачалоЭлемента("value");
				ЗаписьXML.ЗаписатьТекст(СокрЛП(ТекущееЗначение));
				ЗаписьXML.ЗаписатьКонецЭлемента();

				ТекущееЗначение = Неопределено;

			КонецЕсли;

			Если ТекущийСимвол = "}" Тогда

				ЗаписьXML.ЗаписатьКонецЭлемента();

			КонецЕсли;

		ИначеЕсли ТекущийСимвол <> Неопределено Тогда

			ТекущееЗначение = Строка(ТекущееЗначение) + ТекущийСимвол;

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	ЗаписьXML.Закрыть();

	Сообщить("Обработка файла завершена");

КонецЕсли;

